tap "domt4/autoupdate"
tap "gromgit/brewtils"
tap "nikitabobko/tap"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
brew "node"
brew "bitwarden-cli"
brew "btop"
brew "cmatrix"
brew "dotbot"
brew "fastfetch"
brew "fzf"
brew "gemini-cli"
brew "gh"
brew "git"
brew "lazygit"
brew "llmfit"
brew "lsd"
brew "luarocks"
brew "neovim"
brew "ripgrep"
brew "opencode"
brew "starship"
brew "tmux"
brew "yazi"
brew "zellij"
brew "zsh-autocomplete"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "gromgit/brewtils/taproom"
brew "qmk/qmk/qmk"
cask "nikitabobko/tap/aerospace"
cask "calibre"
cask "chatgpt"
cask "claude"
cask "claude-code"
cask "codex"
cask "codex-app"
cask "cursor"
cask "font-atkinson-hyperlegible-mono"
cask "font-atkinson-hyperlegible-next"
cask "font-iosevka-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "linearmouse"
cask "opencode-desktop"
cask "todoist-app"
vscode "batisteo.vscode-django"
vscode "bierner.markdown-checkbox"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "davidanson.vscode-markdownlint"
vscode "donjayamanne.python-extension-pack"
vscode "eamodio.gitlens"
vscode "enkia.tokyo-night"
vscode "google.geminicodeassist"
vscode "kevinrose.vsc-python-indent"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.atom-keybindings"
vscode "njpwerner.autodocstring"
vscode "redhat.vscode-yaml"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "yzhang.markdown-all-in-one"
